__name_pack__ = "ru-ja"
__hieroglyphs__ = True

letters = {
	"а":"あ", "и":"い", "у":"う", "э":"え", "о":"お", "я":"や", "ю":"ゆ", "ё":"よ",
	"ка":"か", "ки":"き", "ку":"く", "кэ":"け", "ко":"こ", "кя":"きゃ", "кю":"きゅ", "кё":"きょ",
	"са":"さ", "си":"し", "су":"す", "сэ":"せ", "со":"そ", "ся":"しゃ", "сю":"しゅ", "сё":"しょ",
	"та":"た", "ти":"ち", "ту":"つ", "тэ":"て", "то":"と", "тя":"ちゃ", "тю":"ちゅ", "тё":"ちょ",
	"на":"な", "ни":"に", "ну":"ぬ", "нэ":"ね", "но":"の", "ня":"にゃ", "ню":"にゅ", "нё":"にょ",
	"ха":"は", "хи":"ひ", "фу":"ふ", "хэ":"へ", "хо":"ほ", "хя":"ひゃ", "хю":"ひゅ", "хё":"ひょ",
	"ма":"ま", "ми":"み", "му":"む", "мэ":"め", "мо":"も", "мя":"みゃ", "мю":"みゅ", "мё":"みょ",
	"ра":"ら", "ри":"り", "ру":"る", "рэ":"れ", "ро":"ろ", "ря":"りゃ", "рю":"りゅ", "рё":"りょ",
	"ва":"わ", 								 "во":"を",
	"н":"ん",

	"га":"が", "ги":"ぎ", "гу":"ぐ", "гэ":"げ", "го":"ご", "гя":"ぎゃ", "гю":"ぎゅ", "гё":"ぎょ",
	"дза":"ざ", "дзи":"じ", "дзу":"ず", "дзэ":"ぜ", "дзо":"ぞ", "дзя":"じゃ", "дзю":"じゅ", "дзё":"じょ",
	"да":"だ", "дзи":"ぢ", "дзу":"づ", "дэ":"で", "до":"ど", "дзя":"ぢゃ", "дзю":"ぢゅ", "дзё":"ぢょ",
	"ба":"ば", "би":"び", "бу":"ぶ", "бэ":"べ", "бо":"ぼ", "бя":"びゃ", "бю":"びゅ", "бё":"びょ",
	"па":"ぱ", "пи":"ぴ", "пу":"ぷ", "пэ":"ぺ", "по":"ぽ", "пя":"ぴゃ", "пю":"ぴゅ", "пё":"ぴょ"
}