__name_pack__ = "en-ru"
__hieroglyphs__ = False

letters = {
	"shch":"щ", "ts":"ц", "ch":"ч", "yu":"ю",
	"kh":"х", "sh":"ш", "ya":"я", "zh":"ж", 
	"а":"a", "r":"р", "b":"б", "c":"с",
	"v":"в", "g":"г", "d":"д", "z":"з",
	"i":"и", "y":"й", "k":"к", "l":"л",
	"m":"м", "n":"н", "o":"о", "p":"п",
	"s":"с", "t":"т", "u":"y", "f":"ф",
	"`":"ь", "y":"ы", "`":"ъ", "e":"э",
	"e":"е",

	"SHCH":"Щ", "TS":"Ц", "CH":"Ч", "YU":"Ю",
	"KH":"Х", "SH":"Ш", "YA":"Я", "ZH":"Ж", 
	"A":"А", "R":"Р", "B":"Б", "C":"С",
	"V":"В", "G":"Г", "D":"Д", "Z":"З",
	"I":"И", "Y":"Й", "K":"К", "L":"Л",
	"M":"М", "N":"Н", "O":"О", "P":"П",
	"S":"С", "T":"Т", "U":"У", "F":"Ф",
	"`":"Ь", "Y":"Ы", "`":"Ъ", "E":"Э",
	"E":"Е"
}